# ==============================================================================
# Terraform Backend Configuration - স্টেট ফাইল রিমোটলি ম্যানেজ করার জন্য
# কাজ: Terraform state ফাইলটি লোকাল মেশিনের পরিবর্তে AWS S3 বাকেটে স্টোর করা হয়।
#       এর ফলে একাধিক ইঞ্জিনিয়ার একই প্রজেক্টে কাজ করতে পারে এবং স্টেট ফাইলটি সুরক্ষিত থাকে।
# ==============================================================================
terraform {
  backend "s3" {
    bucket = "terraform-state-533267105368"
    key    = "user-auth-system/terraform.tfstate"
    region = "ap-south-1"
  }
}
